In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import numpy as np
from numpy.random import randn
import os
import matplotlib.pyplot as plt
""" from myfunctions import * """
np.random.seed(12345) #随机种子设置
plt.rc('figure', figsize=(10, 6)) #设置图片放置的格式
np.set_printoptions(precision=4) #四位有效数字

In [3]:
class side_by_side():
    def __init__(self, *frames):
        self.frames = frames

    def _repr_html_(self):
        width = 100. / len(self.frames)

        s = ""
        for f in self.frames:
            s += "<div style='float: left; border-left : 5px solid #6699cc;'>%s</div>" % f._repr_html_()

        return s

In [4]:
obj = Series([100,99,100,60])
print(obj,'\n\n',obj.values,'\n\n',obj.index)

0    100
1     99
2    100
3     60
dtype: int64

 [100  99 100  60]

 RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=Series([4,7,-5,3],index=['d','a','b','c'])
print(obj2,'\n')
print(obj2['a'],'\n')
print(obj2[['c','a']],'\n')

print(obj2 >0,'\n')
print(obj2[obj2>0])

d    4
a    7
b   -5
c    3
dtype: int64

7

c    3
a    7
dtype: int64

d     True
a     True
b    False
c     True
dtype: bool

d    4
a    7
c    3
dtype: int64

In [6]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [7]:
6 in obj2#索引的是value，而不是index

False

In [8]:
'b' in obj2

True

In [9]:
['b' in obj2.index, 6 in obj2.values]

[True, False]

In [10]:
#直接利用字典来构建Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} #dictionary
obj3=Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)#states里面的所有都会进入obj4的Index，但是如果在字典sdata的对应Index不存在，在obj4中对应的value就是NaN
print(obj4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
#通过isnull来判断是都有缺失值
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
#计算时会自动对齐
print(obj3,'\n\n',obj4,'\n\n',obj3+obj4,'\n')

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

 California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

 California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [14]:
print(obj)
#修改index
obj.index=['Tom','a','b','c']
print('\n',obj)

0    100
1     99
2    100
3     60
dtype: int64

 Tom    100
a       99
b      100
c       60
dtype: int64

In [15]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}#list作为dictionary中的value
print(data,end='\n\n')
frame = DataFrame(data) # Create a Dataframe 
frame #没有指定行的index，采用默认值

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [16]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
print(frame2,'\n')
print(frame2['state'],'\n')
print(frame2.state,'\n')
print(frame.year,'\n')

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [17]:
print(frame2,'\n')
print(frame2.loc['three'],'\n')#获取输入的index所对应的行
print(frame2.loc['one'],'\n')

print(frame2.iloc[3])#完全根据行的位置（数）来引用

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [18]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [19]:
frame2['debt']=16.99#默认为是对列进赋值
frame2

       year   state  pop   debt
one    2000    Ohio  1.5  16.99
two    2001    Ohio  1.7  16.99
three  2002    Ohio  3.6  16.99
four   2001  Nevada  2.4  16.99
five   2002  Nevada  2.9  16.99

In [20]:
a=np.arange(5)#使用ndarray进行赋值
print(a,'\n')
frame2['debt']=a
frame2

[0 1 2 3 4]

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [21]:
random_col=np.random.randint(100,size=len(frame2))
frame2.insert(3,'random_col',random_col)
frame2

       year   state  pop  random_col  debt
one    2000    Ohio  1.5          98     0
two    2001    Ohio  1.7          29     1
three  2002    Ohio  3.6           1     2
four   2001  Nevada  2.4          36     3
five   2002  Nevada  2.9          41     4

In [ ]:
del frame2['pop']
frame2.columns
frame2